In [1]:
import pandas as pd
from datetime import datetime
from IPython.display import display
df = pd.read_csv("Spendings_csv.csv", parse_dates=["Date"], date_format="%d/%m/%Y")
df = df.rename({column: column.strip() for column in df.columns}, axis=1)
df.head()

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

        Date    Who           What Category   Price
0 2023-09-11  Pasha          Pango  Parking    8.00
1 2023-09-11  Pasha      Shufersal  Grocery   90.90
2 2023-09-11  Alona        Tiv Tav  Grocery   60.00
3 2023-09-12  Pasha  Keshet Teamim  Grocery  323.74
4 2023-09-13  Alona        Tiv Tav  Grocery   77.00

In [2]:
def info_by_month(df, month="", date_beg="", date_end="", price_apt=3600):
    date_beg_dt = datetime.strptime(date_beg, "%d/%m/%Y")
    date_end_dt = datetime.strptime(date_end, "%d/%m/%Y")    
    df_cut = df[(df["Date"] >= date_beg_dt) & (df["Date"] <= date_end_dt)]
    print(f"Spendings in {month}: {df_cut['Price'].sum().round(2)} sheckels")
    print(f"Spendings in {month} with the appartment: {df_cut['Price'].sum().round(2) + price_apt} sheckels")

    category = df_cut.groupby("Category").agg({"Price": "sum"}).sort_values("Price", ascending=False)
    display(category)

    final = df_cut.groupby("Who").agg({"Price": "sum"}).sort_values("Price", ascending=False)
    final["Price_apt"] = final["Price"] + price_apt / 2
    display(final)

In [3]:
info_by_month(df, month="September", date_beg="10/09/2023", date_end="09/10/2023")

Spendings in September: 6962.6 sheckels
Spendings in September with the appartment: 10562.6 sheckels

                 Price
Category
Grocery        2484.88
Fuel           1301.93
Restaurants     856.70
SuperPharm      807.09
Auto            674.00
Beauty          380.00
Home            290.00
Entertainment   120.00
Presents         40.00
Parking           8.00

        Price  Price_apt
Who
Pasha  5990.0     7790.0
Alona   972.6     2772.6

In [4]:
info_by_month(df, month="October", date_beg="10/10/2023", date_end="09/11/2023")

Spendings in October: 3890.36 sheckels
Spendings in October with the appartment: 7490.360000000001 sheckels

               Price
Category
Grocery      1714.53
Fuel          819.43
Beauty        320.00
Presents      284.00
Home          224.00
SuperPharm    155.90
Parking       142.00
Clothes       120.00
Treatment      45.00
Restaurants    35.00
Macabi         30.50

         Price  Price_apt
Who
Pasha  3240.76    5040.76
Alona   649.60    2449.60

In [5]:
test = info_by_month(df, month="November", date_beg="10/11/2023", date_end="09/12/2023")

Spendings in November: 7959.04 sheckels
Spendings in November with the appartment: 11559.04 sheckels

                 Price
Category
Grocery        2146.84
Fuel           1292.23
Restaurants     791.00
Home            739.20
Presents        727.70
Auto            648.00
Beauty          532.00
Treatment       388.47
SuperPharm      218.60
Health          200.00
Parking         155.00
Entertainment   120.00

         Price  Price_apt
Who
Pasha  5880.54    7680.54
Alona  2078.50    3878.50

In [6]:
test = info_by_month(df, month="December", date_beg="10/12/2023", date_end="09/01/2024")

Spendings in December: 12409.79 sheckels
Spendings in December with the appartment: 16009.79 sheckels

                 Price
Category
Auto           3215.19
Health         2623.50
Grocery        2370.14
Fuel            994.14
Home            770.58
Utility bills   758.00
Presents        691.80
Treatment       494.94
Restaurants     341.50
Beauty          150.00

         Price  Price_apt
Who
Pasha  8480.39   10280.39
Alona  3929.40    5729.40

In [7]:
test = info_by_month(df, month="January", date_beg="10/01/2024", date_end="09/02/2024")

Spendings in January: 11452.65 sheckels
Spendings in January with the appartment: 15052.65 sheckels

                 Price
Category
Health         3908.50
Grocery        2485.39
Fuel           1561.12
Beauty          933.00
Home            853.60
Presents        664.90
Treatment       406.14
Utility bills   178.00
Restaurants     167.00
Clothes         150.00
Parking         111.00
Education        34.00

         Price  Price_apt
Who
Pasha  7686.05    9486.05
Alona  3766.60    5566.60

In [8]:
test = info_by_month(df, month="February", date_beg="10/02/2024", date_end="09/03/2024")

Spendings in February: 13464.37 sheckels
Spendings in February with the appartment: 17064.370000000003 sheckels

                 Price
Category
Home           3811.90
Health         2243.35
Grocery        1983.62
Restaurants    1427.80
Presents       1007.00
Utility bills   881.86
Fuel            807.84
Treatment       689.30
Parking         285.00
SuperPharm      176.70
Beauty          150.00

         Price  Price_apt
Who
Pasha  7691.09    9491.09
Alona  5773.28    7573.28

In [9]:
test = info_by_month(df, month="March", date_beg="10/03/2024", date_end="09/04/2024", price_apt=3600+5700)

Spendings in March: 11934.78 sheckels
Spendings in March with the appartment: 21234.78 sheckels

                 Price
Category
Home           3922.05
Grocery        2198.39
Fuel           1207.80
Health         1084.50
Restaurants     834.80
Treatment       728.06
Utility bills   481.58
Beauty          420.00
Clothes         330.00
Goverment       270.00
Presents        236.70
Parking         109.00
SuperPharm       95.90
Other            16.00

         Price  Price_apt
Who
Pasha  7751.58   12401.58
Alona  4183.20    8833.20

In [10]:
test = info_by_month(df, month="April", date_beg="10/04/2024", date_end="09/05/2024", price_apt=5700)

Spendings in April: 9463.51 sheckels
Spendings in April with the appartment: 15163.51 sheckels

                 Price
Category
Grocery        2733.67
Presents       1537.00
Beauty         1161.00
Restaurants    1144.80
Health          839.00
Utility bills   460.00
Fuel            410.92
Clothes         257.00
Treatment       247.52
Education       235.00
Home            180.60
Auto            169.00
Parking          88.00

         Price  Price_apt
Who
Pasha  6221.71    9071.71
Alona  3241.80    6091.80

In [3]:
test = info_by_month(df, month="May", date_beg="10/05/2024", date_end="09/06/2024", price_apt=5700)

Spendings in May: 11613.28 sheckels
Spendings in May with the appartment: 17313.28 sheckels

                 Price
Category
Grocery        2418.92
Presents       2178.00
Restaurants    1432.90
Health         1061.00
Fuel            849.72
Home            796.60
Entertainment   730.00
Treatment       722.52
Utility bills   647.62
Beauty          480.00
Education       265.00
Parking          31.00

         Price  Price_apt
Who
Pasha  7795.17   10645.17
Alona  3818.11    6668.11